{"overall_score": 4, "overall_score_comment": "A solid 4 out of 10 — like Tommy's financial planning skills.", "the_roast": "Let me get this straight: we open with 'Once upon a time, not so long ago' like we're reading a bedtime story about economic depression. Tommy worked on the docks, union's on strike, and his brilliant solution is to... pawn his guitar? That's not 'living on a prayer,' that's living on weaponized optimism and a complete absence of a resume.\n\nMeanwhile, Gina's out here 'working for her man' and 'bringing home her pay,' which sounds less like a love story and more like she's the only functioning adult in this relationship. She's pulling double shifts at the diner while Tommy's at home whispering 'someday' like it's a financial strategy. Newsflash: 'someday' doesn't pay the rent, and neither does a pawned guitar that 'used to make it talk.' What did it say, Tommy? 'Get a job'?\n\nThe chorus insists 'it doesn't make a difference if we make it or not' — which is exactly the kind of thing you say when you've given up on making it. 'We've got each other and that's a lot' is beautiful until the lights get shut off. And they're only 'halfway there'? Halfway to WHERE? Bankruptcy court? The chorus is basically Stockholm Syndrome set to a killer riff.\n\nThe bridge delivers the absolute gem: 'You live for the fight when it's all that you've got.' Brother, if fighting is ALL you've got, maybe update that LinkedIn profile. This isn't inspirational — it's a cry for help wrapped in denim and hairspray. The whole song is like a motivational poster written by someone who's never seen a motivational poster work.", "cliche_counter": [{"cliche": "Working-class Romeo and Juliet", "quip": "Except instead of dying for love, they're dying from lack of health insurance"}, {"cliche": "Love conquers all", "quip": "Love is great, but have you tried paying your bills?"}, {"cliche": "Hold on to what you've got", "quip": "What they've got is debt and delusion"}, {"cliche": "Take my hand and we'll make it", "quip": "Make it where? To the food bank?"}, {"cliche": "Tough times build character", "quip": "Tommy's character is 'unemployed with a dream'"}, {"cliche": "The 'someday' promise", "quip": "Someday is not a business plan, Tommy"}], "lyrical_crime_highlights": [{"line": "Tommy got his six string in hock", "crime": "Using your primary income source as collateral", "sentence": "Mandatory personal finance class and a subscription to Indeed.com"}, {"line": "It doesn't make a difference if we make it or not", "crime": "Defeatism disguised as romantic realism", "sentence": "Forced to watch every episode of Shark Tank until he understands how goals work"}, {"line": "Working for her man, she brings home her pay", "crime": "Making 1986 gender dynamics sound romantic", "sentence": "Gina gets a raise and Tommy gets a lecture on emotional labor"}, {"line": "We're half way there", "crime": "Mathematical impossibility — halfway to what destination?", "sentence": "Must show his work and provide a specific GPS coordinate"}, {"line": "You live for the fight when it's all that you've got", "crime": "Glorifying struggle instead of, you know, problem-solving", "sentence": "Write a 500-word essay on the difference between perseverance and poor planning"}], "hidden_meanings": "This song is clearly a metaphor for trickle-down economics: everyone's waiting for something good to happen while pretending the current situation is sustainable. Tommy pawning his guitar represents giving up your dreams for immediate cash, which is exactly what Jon Bon Jovi DIDN'T do — making this the ultimate 'do as I say, not as I do' anthem.", "final_verdict": "This is poverty cosplay for the arena rock set — a anthem for people who confuse stubbornness with strength. It's the musical equivalent of putting 'live, laugh, love' on your eviction notice.", "artist": "Bon Jovi", "title": "Livin' on a Prayer", "severity": "medium"}