{"overall_score": 7, "overall_score_comment": "Like a revenge plot written by someone who just discovered metaphors and got really excited about it.", "the_roast": "Adele starts this breakup anthem by diagnosing herself with what sounds like severe heartburn—'there's a fire starting in my heart, reaching a fever pitch.' Ma'am, that's called acid reflux, and Tums are available at any pharmacy. But instead of seeking medical attention, she threatens to 'lay your sheet bare,' which sounds less like romantic revenge and more like she's planning to expose his thread count on social media.\n\nThe whole 'rolling in the deep' thing is admirably committed to an aquatic metaphor that nobody fully understands. Are we underwater? Are we gambling? Are we making pasta? She's making a home in the 'depths of your despair,' which is either deeply poetic or the plot of a psychological thriller where someone moves into your sadness rent-free. The real estate market is tough, I guess.\n\nThen there's the heart-in-hand imagery: 'You had my heart inside of your hand, and you played it to the beat.' So... he was using her heart as a bongo drum? That's not romance, that's a crime scene. And she repeats 'we could have had it all' approximately seventy-three times, like she's trying to convince herself more than him. Yes, Adele, we heard you the first twelve times—you're upset about the missed potential. The 'you played it to the beat' refrain gets repeated so much that by the end, it sounds like she's just describing a really aggressive game of patty-cake.", "cliche_counter": [{"cliche": "Fire in my heart", "quip": "The cardiovascular system called—it wants its symbolism back"}, {"cliche": "Scars of your love", "quip": "Love apparently comes with the same warning label as a chainsaw"}, {"cliche": "You reap what you sow", "quip": "Breaking out the farmer's almanac for relationship advice"}, {"cliche": "We could have had it all", "quip": "Said eight thousand times, as if repetition makes it more true"}], "lyrical_crime_highlights": [{"line": "I'm gonna make your head burn / Think of me in the depths of your despair / Making a home down there", "crime": "Threatening to become a psychological squatter in someone's emotional basement", "sentence": "Restraining order and mandatory therapy for both parties"}, {"line": "You had my heart inside of your hand / And you played it to the beat", "crime": "Turning organ donation into a percussion instrument", "quip": "Banned from all future jam sessions"}, {"line": "Throw your soul through every open door", "crime": "Encouraging reckless soul-throwing without proper safety equipment", "sentence": "Must attend a seminar on spiritual workplace safety"}, {"line": "Baby, I have no story to be told / But I've heard one of you", "crime": "Starting the most epic revenge song by admitting she has nothing to say", "sentence": "Enrolled in a creative writing course on compelling narratives"}], "hidden_meanings": "Clearly this is an allegory about someone who lost at poker ('rolling' dice, playing cards, 'played it to the beat'). The 'deep' is obviously the poker pot, and she's angry because her ex went all-in with her heart chips and then folded. The fire? That's just the cigarette smoke in the casino.", "final_verdict": "A masterclass in melodramatic heartbreak that threatens arson, squatting, and percussion-based cardiac assault—all set to an absolute banger of a melody. We forgive the lyrical chaos because that voice could make a grocery list sound like Shakespeare's lost tragedy.", "artist": "Adele", "title": "Rolling in the Deep", "severity": "mild"}