{"overall_score": 3, "overall_score_comment": "A 3 out of 10 – the same score you'd get on a commitment if your only promise was 'never gonna' do basic human decency.", "the_roast": "Let's address the elephant in the room: Rick wrote a song where the ENTIRE hook is just a list of things he won't do. Not things he WILL do – things he WON'T do. That's like proposing to someone by saying 'I promise not to steal your kidney!' Congratulations, Rick, you've set the bar so low it's basically a tripping hazard in hell. 'Never gonna give you up, never gonna let you down' – buddy, that's not romance, that's the bare minimum requirements for not being a restraining order waiting to happen.\n\nAnd can we talk about 'We're no strangers to love / You know the rules and so do I'? What rules, Rick? What RULES? Did I miss the Geneva Convention on Dating? Is there a rulebook? Because opening your love song with 'you know the bureaucratic regulations of romance' is about as sexy as reading Terms & Conditions out loud on a first date. Then he hits us with 'A full commitment's what I'm thinking of / You wouldn't get this from any other guy.' Oh REALLY? Because every guy from here to Timbuktu has promised commitment. You're not special, Rick. You're basically showing up to a potluck with store-bought potato salad and acting like you invented cuisine.\n\nThe narcissism in 'Your heart's been aching, but you're too shy to say it / Inside, we both know what's been going on' is STUNNING. He's literally telling this woman how SHE feels and what SHE knows. That's not romantic intuition, Rick – that's gaslighting with a synthesizer. 'We know the game, and we're gonna play it'? What game? Monopoly? Russian Roulette? Emotional manipulation bingo? The man is so vague he makes fortune cookies look like doctoral dissertations.\n\nBut the real crime is the repetition. The chorus appears SEVENTEEN TIMES if you count all the variations. Rick said 'never gonna give you up' so many times that by the end, you're actually BEGGING him to give you up just to hear something new. It's like being held hostage by the world's most optimistic parrot. The song is 3 minutes and 33 seconds of Rick essentially saying 'I'm not a terrible person' on loop until you develop Stockholm Syndrome. And that 'Ooh (Give you up)' breakdown near the end? That's not a musical interlude – that's the sound of the English language filing for divorce.", "cliche_counter": [{"cliche": "We're no strangers to love", "quip": "Thanks for clarifying you've heard of love, Rick. Really raised the bar there."}, {"cliche": "You know the rules", "quip": "The first rule of Romance Club is apparently to bore everyone with vague references to rules."}, {"cliche": "A full commitment's what I'm thinking of", "quip": "Wow, commitment in a relationship? What a revolutionary concept! Someone call the Nobel Prize committee!"}, {"cliche": "Your heart's been aching", "quip": "My heart's aching too – from this predictable pseudo-poetic nonsense."}, {"cliche": "We know the game", "quip": "The only game here is how many times you can recycle the same four tired relationship metaphors."}, {"cliche": "Never gonna say goodbye", "quip": "Unlike this song, which refuses to say goodbye to itself for THREE AND A HALF MINUTES."}], "lyrical_crime_highlights": [{"line": "You wouldn't get this from any other guy", "crime": "False advertising and delusion of uniqueness", "sentence": "Sentenced to attend every open mic night in history to realize you're not special."}, {"line": "We know the game, and we're gonna play it", "crime": "Being intentionally vague to sound deep", "sentence": "Forced to explain what 'the game' is to a panel of confused philosophers for eternity."}, {"line": "Don't tell me you're too blind to see", "crime": "Passive-aggressive guilt-tripping disguised as romance", "sentence": "Must write 'I will not manipulate people through lyrics' 1,000 times on a chalkboard made of discarded 80s keyboards."}, {"line": "Never gonna run around and desert you", "crime": "Using 'desert' as a verb in 1987 like you're writing Victorian poetry", "sentence": "Banished to the actual desert with only a thesaurus and your regrets."}, {"line": "Inside, we both know what's been going on", "crime": "Presumptuous mansplaining of emotions", "sentence": "Required to ask people how they ACTUALLY feel instead of telling them for the rest of time."}], "hidden_meanings": "Clearly, this song is a metaphor for emotional constipation – Rick is so focused on what he WON'T do that he never gets around to what he WILL do. It's a masterclass in negative space relationships, where the absence of toxicity is mistaken for the presence of actual substance. Deep down, Rick is teaching us that the ultimate commitment is just... not being awful? Revolutionary.", "final_verdict": "This song is the lyrical equivalent of a participation trophy – it celebrates the absolute bare minimum of human decency and expects a standing ovation. Rick Astley wrote three verses about not being a terrible person and somehow convinced a generation it was romantic.", "artist": "Rick Astley", "title": "Never Gonna Give You Up", "severity": "savage"}