{"overall_score": 6, "overall_score_comment": "Like Tommy's guitar skills, this one's stuck somewhere between pawn shop and stadium—functional, but you wouldn't call it refined.", "the_roast": "Let's start with that opening: 'Once upon a time, not so long ago.' Pick a lane, Jon! Is this a fairy tale or a news report? You can't have your nostalgic cake and eat it too. And Tommy 'used to work on the docks'—used to? My guy, the song just started and he's already unemployed. That's less of an origin story and more of a LinkedIn profile that needs updating.\n\nThe real MVP here is Gina, who's apparently 'working for her man' and bringing home her pay. Nothing says 1980s romance like describing your relationship as unpaid labor management. She's out here working double shifts at the diner while Tommy's at home cradling his pawned guitar like it's a lost puppy. 'His six string in hock, now he's holding in what he used to make it talk'—buddy, that's just called not having a guitar. We don't need a poetic metaphor for being broke.\n\nThen we get the philosophical gem: 'It doesn't make a difference if we make it or not.' That's not inspirational, that's just giving up with backup singers. This is the motivational equivalent of a participation trophy. And they're 'halfway there'—halfway to WHERE? Financial stability? A working guitar? An actual plan? The song never tells us, which is perfect because neither do Tommy and Gina.\n\nThe real kicker is 'You live for the fight when it's all that you've got.' Translation: our lives are so empty that struggle itself has become our hobby. It's like making 'surviving' your entire personality. Tommy and Gina aren't living on a prayer—they're living on denial with a catchy chorus.", "cliche_counter": [{"cliche": "Working-class struggle as romance", "quip": "Nothing says 'I love you' like economic anxiety and shift work"}, {"cliche": "The pawned guitar trope", "quip": "Every songwriter's favorite symbol for dreams deferred—right next to rain as sadness"}, {"cliche": "Hold on to what we've got", "quip": "Which is apparently nothing, so this is just holding on to air"}, {"cliche": "Take my hand", "quip": "The lyrical equivalent of clip art—generic enough for any occasion"}, {"cliche": "Someday it'll get better", "quip": "The eternal promise of people who haven't updated their resume in six years"}], "lyrical_crime_highlights": [{"line": "Once upon a time, not so long ago", "crime": "Temporal contradiction in the first degree", "sentence": "Must choose between being a fairy tale or a documentary"}, {"line": "Working for her man, she brings home her pay", "quip": "Outdated gender dynamics", "sentence": "Mandatory enrollment in a 21st-century relationship seminar"}, {"line": "It doesn't make a difference if we make it or not", "crime": "Defeatism disguised as optimism", "sentence": "Forced to attend motivational speaking class taught by actual successful people"}, {"line": "We're half way there", "crime": "Destination fraud—no endpoint specified", "sentence": "Must provide GPS coordinates of where 'there' actually is"}, {"line": "His six string in hock", "crime": "Overcomplicated way to say 'sold his guitar'", "sentence": "Write 'I pawned my guitar' 100 times in plain English"}], "hidden_meanings": "Clearly this is a Marxist allegory about labor exploitation, where Tommy represents the alienated proletariat separated from his means of production (the guitar), while Gina embodies false consciousness by accepting her role in the capitalist structure. 'Livin' on a prayer' is obviously a critique of religion as the opiate of the masses. Or maybe it's just about two broke people with decent harmonies.", "final_verdict": "This song is the musical equivalent of inspirational wall art from HomeGoods—vague enough to mean anything, catchy enough that you don't care. Tommy and Gina may be living on a prayer, but this song is living on pure 80s charisma and our collective willingness to overlook that it's basically about two people whose life plan is 'hope real hard.'", "artist": "Bon Jovi", "title": "Livin' on a Prayer", "severity": "mild"}