{"overall_score": 3, "overall_score_comment": "The literary equivalent of a participation trophy at a poetry slam in a truck stop bathroom.", "the_roast": "Let's start with 'South Detroit' — a place that DOESN'T EXIST unless you count Windsor, Canada, which means our city boy was 'born and raised' in a geographic hallucination. Steve Perry out here writing fan fiction about imaginary neighborhoods like he's J.R.R. Tolkien but for people who peaked in high school. The whole song is basically two broke people meeting on public transportation with zero plan, zero destination, just vibes and reckless financial irresponsibility. 'Goin' anywhere' isn't romantic, it's called being homeless with a train pass.\n\nThen we get the Pulitzer-worthy couplet 'A singer in a smokey room / A smell of wine and cheap perfume' — yes, that's called a dive bar at 2 AM, not a Meet Cute. These two are about to 'share the night' based on a smile, which is apparently all the vetting process you need when your standards are lower than the floor of that smokey room. 'For a smile they can share the night' has the same energy as 'for a Klondike bar, what would you do?' except sadder and with more questionable decisions.\n\n'Streetlights, people' might be the laziest lyrical pairing since someone rhymed 'fire' with 'desire.' It's not even a complete thought! It's like Perry forgot the rest of the sentence mid-karaoke and just decided to make it the chorus. And we're supposed to believe these random nouns constitute profound wisdom? 'Living just to find emotion, hiding somewhere in the night' — my brother in Christ, that's called having depression and poor coping mechanisms, not a philosophy. The whole song is basically an aesthetic mood board for people who think waiting for a bus is deep.\n\nThe gambling metaphor comes in with 'Payin' anything to roll the dice just one more time' like we're supposed to find profundity in people with obvious addiction issues. 'Some will win, some will lose, some were born to sing the blues' — congratulations, you've discovered that life has outcomes. That's not wisdom, that's a fortune cookie written by someone going through an existential crisis at a craps table. And 'the movie never ends, it goes on and on and on and on' — yeah, that's the problem with this song too, buddy. We get it. Things continue. You can stop now.\n\nAnd finally, FINALLY, we get to the titular advice: 'Don't stop believin' — in WHAT?! You never told us! Believing in finding South Detroit on a map? Believing that meeting strangers on trains based solely on their smile is a solid life strategy? The song is basically telling us to have hope without ever specifying hope FOR WHAT. It's the motivational poster equivalent of 'Live, Laugh, Love' except it costs $15 for a beer every time someone plays it at a wedding.", "cliche_counter": [{"cliche": "Small town girl meets city boy", "quip": "Wow, what a fresh take! Did Nicholas Sparks ghostwrite this between Hallmark movies?"}, {"cliche": "Midnight train as a metaphor for escape", "quip": "Because nothing says 'follow your dreams' like sketchy late-night public transit"}, {"cliche": "Smokey room + cheap perfume = atmosphere", "quip": "The official scent of every bad decision ever made after 11 PM"}, {"cliche": "Life is like gambling/rolling dice", "quip": "Deep insight from the guy who clearly lost his thesaurus in a poker game"}, {"cliche": "Generic 'don't stop believing' platitude", "quip": "The lyrical equivalent of your drunk uncle's motivational Facebook posts"}, {"cliche": "Movie never ends / goes on and on", "quip": "Unlike my patience for metaphors that say absolutely nothing"}], "lyrical_crime_highlights": [{"line": "Born and raised in South Detroit", "crime": "Geographic fiction and fraudulent claims", "sentence": "Mandatory geography class and a public apology to the entire city of Windsor"}, {"line": "Streetlights, people", "crime": "Incomplete sentence masquerading as profound chorus", "sentence": "Sentenced to finish his sentences like an adult for the rest of his natural life"}, {"line": "For a smile they can share the night", "crime": "Promoting dangerously low standards for human connection", "sentence": "Required to use a dating app with actual vetting questions"}, {"line": "It goes on and on and on and on", "crime": "Repetitive redundancy that's repetitively redundant", "sentence": "Forced to listen to this exact phrase on loop until he understands irony"}, {"line": "Don't stop believin'", "crime": "Vague motivational nonsense with zero actionable advice", "sentence": "Must specify WHAT to believe in or face 500 hours of life coaching"}], "hidden_meanings": "This song is clearly an allegory for the American public transit system's failure to provide adequate late-night service, forcing small town girls and geographically confused city boys to bond over shared transportation trauma. The 'smokey room' represents capitalism, the 'cheap perfume' is trickle-down economics, and 'streetlights, people' is actually a desperate plea for better urban planning and mental health resources.", "final_verdict": "Journey took every songwriting cliché, threw in a fake city, forgot to finish several sentences, and somehow convinced three generations that this constitutes wisdom. It's the musical equivalent of a motivational poster that fell behind the fridge in 1981 and nobody noticed.", "artist": "Journey", "title": "Don't Stop Believin'", "severity": "savage"}