{"overall_score": 3, "overall_score_comment": "A three out of ten, much like Tommy and Gina's chances of actual financial stability.", "the_roast": "Let's start with the opening line: 'Once upon a time, not so long ago' — pick a lane, Shakespeare! Either commit to the fairy tale or give us a timeline. This isn't Schrödinger's backstory. And then we meet Tommy, who 'used to work on the docks' until the union strike left him 'down on his luck...it's tough, so tough.' Wow, riveting stuff. You said 'tough' twice in case we didn't grasp that poverty is, indeed, not fun. Meanwhile, Gina is 'working for her man' and 'brings home her pay' — ah yes, nothing screams romance like being your boyfriend's ATM while he sits home with his pawned guitar having an existential crisis.\n\nThe chorus is where this lyrical trainwreck really catches fire. 'It doesn't make a difference if we make it or not' — EXCUSE ME? That's your motivational anthem? That's like a life coach saying 'honestly, you're probably screwed either way, but hey, we tried!' And they're 'halfway there' to what exactly? Halfway to homelessness? Halfway to accepting they should've stayed in school? The prayer they're living on better include a financial advisor. Then Tommy whispers 'Baby it's okay, someday' when Gina cries at night dreaming of escape. My guy, your motivational speech game is weaker than your job prospects. 'Someday' isn't a plan, Tommy, it's what people say when they've given up but don't want to admit it.\n\nThe bridge delivers the coup de grâce: 'You live for the fight when it's all that you've got.' So your entire life philosophy is Stockholm Syndrome with poverty? This isn't inspirational, it's a hostage situation with a sick beat. These lyrics read like someone tried to write 'Born to Run' but ran out of gas, sold the car for rent money, and decided to call hopelessness 'romantic.' Tommy's guitar is in hock, Gina's crying herself to sleep, and their big dream is that they're 'halfway there' to an undefined destination while surviving on thoughts and prayers. This isn't a love song, it's a cautionary tale about financial planning set to a power chord.", "cliche_counter": [{"cliche": "Working class romance against all odds", "quip": "Because nothing says 'I love you' like shared destitution and crushed dreams"}, {"cliche": "The pawned guitar as a symbol of lost dreams", "quip": "The musical equivalent of showing us a dead dog to make us feel something"}, {"cliche": "'Take my hand' as relationship reassurance", "quip": "Sure, take his hand — just don't expect it to be holding a paycheck anytime soon"}, {"cliche": "Vague references to 'someday' and 'halfway there'", "quip": "Destinations so undefined they make a Magic 8 Ball look like GPS"}, {"cliche": "'We've got each other' as the ultimate consolation prize", "quip": "The participation trophy of relationship mantras"}, {"cliche": "The tough guy who whispers sweet nothings", "quip": "Tommy whispers 'it's okay' while the repo man whispers back 'it's really not'"}], "lyrical_crime_highlights": [{"line": "It doesn't make a difference if we make it or not", "crime": "Motivational manslaughter", "sentence": "Mandatory life coaching sessions until you understand that outcomes actually DO matter"}, {"line": "We're half way there", "crime": "Geographical ambiguity in the first degree", "sentence": "Required to specify WHERE exactly you're going before making travel claims"}, {"line": "Working for her man, she brings home her pay", "crime": "Romanticizing financial codependency", "sentence": "Immediate enrollment in a course on relationship economics and personal boundaries"}, {"line": "It's tough, so tough", "crime": "Criminal redundancy and lazy vocabulary", "sentence": "One hundred hours of community service reading a thesaurus out loud"}, {"line": "You live for the fight when it's all that you've got", "crime": "Weaponizing toxic positivity", "sentence": "Forced to watch every episode of 'Financial Peace University' with your eyes taped open"}], "hidden_meanings": "Clearly this is an allegory for late-stage capitalism's ability to convince the working class that systemic poverty is actually a romantic adventure. Tommy's pawned guitar represents the death of artistic expression under economic oppression, while Gina's tears symbolize the collective consciousness finally waking up to the fact that love doesn't pay the electric bill. The 'prayer' they're living on? It's actually a desperate plea to any deity listening that trickle-down economics might finally trickle.", "final_verdict": "This song is what happens when you mistake financial desperation for destiny and decide that's not just okay, but something to belt out at karaoke. Tommy and Gina don't need a prayer — they need a credit counselor, a job placement service, and possibly couples therapy.", "artist": "Bon Jovi", "title": "Livin' on a Prayer", "severity": "savage"}