{"overall_score": 6, "overall_score_comment": "It's like a relationship contract written by someone who just discovered promises exist.", "the_roast": "Rick starts with 'We're no strangers to love' and then immediately treats us like we've never heard of commitment before, explaining it like a PowerPoint presentation at Corporate Romance 101. 'You know the rules and so do I' — buddy, if love had rules this clear, divorce lawyers would be out of business. He's really out here claiming 'you wouldn't get this from any other guy' as if baseline human decency is some kind of limited-time exclusive offer.\n\nThe chorus is essentially a checklist of things he promises NOT to do, which is like proposing by saying 'I promise not to set your car on fire or join a circus.' 'Never gonna run around and desert you' is such a specific promise that I'm concerned about Rick's past relationship history. Did someone hurt you in the desert, Rick? The repetition of this chorus roughly fourteen thousand times suggests he's either REALLY committed or trying to convince himself.\n\nThen we get the ultimate passive-aggressive moment: 'Your heart's been aching, but you're too shy to say it' followed by 'Don't tell me you're too blind to see.' So which is it, Rick? Is she shy or blind? Make up your mind! He's diagnosing her emotional state like a motivational poster come to life, claiming 'we both know what's been going on' — if you BOTH know, why are we having this conversation? 'We know the game, and we're gonna play it' makes this whole romance sound like a strategic board game night rather than actual love.", "cliche_counter": [{"cliche": "Listing everything you WON'T do instead of what you WILL", "quip": "The anti-bucket list approach to romance"}, {"cliche": "Claiming to know exactly how someone else feels", "quip": "Emotional mind-reading: not as romantic as you think"}, {"cliche": "Repeating the same promise over and over for emphasis", "quip": "Say it once, we believe you. Say it twelve times, we're calling security"}, {"cliche": "The 'rules of love' that apparently everyone knows", "quip": "Still waiting for my copy of this rulebook"}], "lyrical_crime_highlights": [{"line": "Never gonna run around and desert you", "crime": "Creating the world's most specific abandonment scenario", "sentence": "Must watch 'Lawrence of Arabia' and write an essay on proper desert etiquette"}, {"line": "You know the rules and so do I", "crime": "Assuming love operates like a board game instruction manual", "sentence": "Required to explain these mysterious rules in detail to a confused jury"}, {"line": "Your heart's been aching, but you're too shy to say it", "crime": "Diagnosing someone else's emotions without a license", "sentence": "Banned from all WebMD-style relationship analysis for six months"}, {"line": "We know the game, and we're gonna play it", "crime": "Making love sound like competitive sport", "sentence": "Must clarify whether relationship or chess tournament"}, {"line": "A full commitment's what I'm thinking of", "crime": "Announcing commitment like a quarterly business goal", "sentence": "Required to attend remedial Romance For Humans workshop"}], "hidden_meanings": "Clearly this is a sophisticated metaphor about Rick's career in the furniture moving business — 'never gonna let you down' is about proper lifting technique, while 'run around and desert you' refers to his pledge to never abandon a client mid-relocation to Las Vegas. The repetition represents the monotonous nature of explaining warranty terms to customers.", "final_verdict": "It's a perfectly adequate promise wrapped in the musical equivalent of bubble wrap — protective, repetitive, and you can't stop popping it even though you know you should. The song that launched a billion internet pranks is basically just Rick Astley reading his relationship terms and conditions out loud for three minutes.", "artist": "Rick Astley", "title": "Never Gonna Give You Up", "severity": "mild"}