{"overall_score": 4, "overall_score_comment": "A solid 4 out of 10 — which coincidentally is also the number of unique ideas in the entire song.", "the_roast": "Rick Astley wrote a love song that reads like a terms of service agreement. 'Never gonna give you up, never gonna let you down, never gonna run around and desert you' — congratulations, you've just described the bare minimum requirements for not being a terrible person. That's not romance, that's a checklist for basic human decency. 'Hey baby, I promise I won't abandon you in the desert!' Wow, swoon. Next you'll be promising not to steal her car or frame her for tax evasion.\n\nThe gaslighting energy of 'Your heart's been aching, but you're too shy to say it' is absolutely unhinged. How does Rick know her heart is aching? Is he a cardiologist? A psychic? Or just a guy who watched her from across the room and decided he knows her entire emotional state? 'Inside, we both know what's been going on' — do we, Rick? Because it sounds like YOU know what's been going on and she's just been living her life. 'We know the game, and we're gonna play it' makes this whole thing sound less like a love song and more like a psychological thriller where Rick has been planning this relationship like it's a chess match.\n\nThe song repeats the chorus approximately seven hundred times, which is perfect if you're trying to brainwash someone into accepting your mediocre relationship pitch. By the third round of 'never gonna give you up,' I'm ready to give MYSELF up — to the authorities, to a monastery, to anyone who can make it stop. The bridge is literally just 'Ooh (Give you up)' over and over, which is less of a lyrical choice and more of a cry for help from a writer who ran out of ideas somewhere around verse one. This song has the emotional depth of a motivational poster in a dentist's office and the lyrical variety of a broken vending machine.", "cliche_counter": [{"cliche": "We're no strangers to love", "quip": "Nothing says 'I'm about to blow your mind' like immediately establishing how completely unremarkable this whole thing is."}, {"cliche": "You know the rules and so do I", "quip": "The rules of love, apparently written by someone who thinks relationships come with an instruction manual from IKEA."}, {"cliche": "A full commitment's what I'm thinking of", "quip": "How romantic — he's 'thinking of' commitment like he's considering what to have for lunch."}, {"cliche": "Your heart's been aching, but you're too shy to say it", "quip": "Every stalker's favorite opening line, now set to a catchy beat."}, {"cliche": "Never gonna say goodbye", "quip": "Weirdly threatening when you think about it — like, what if she WANTS to say goodbye, Rick?"}, {"cliche": "We know the game, and we're gonna play it", "quip": "Love as a strategic board game — truly the foundation of all healthy relationships."}], "lyrical_crime_highlights": [{"line": "You wouldn't get this from any other guy", "crime": "False advertising and unsubstantiated claims", "sentence": "Mandatory course in realistic self-assessment and competition analysis."}, {"line": "Don't tell me you're too blind to see", "quip": "Aggressive assumption of mutual feelings", "sentence": "Restraining order and a class on reading social cues."}, {"line": "Never gonna run around and desert you", "crime": "Using 'desert' as a verb like we're in a Charles Dickens novel", "sentence": "Return to 1987 and stay there with your archaic vocabulary."}, {"line": "Inside, we both know what's been going on", "crime": "Presumptuous mind-reading without a license", "sentence": "Banned from all future assumptions about other people's internal states."}, {"line": "Ooh-ooh-ooh-ooh", "crime": "Padding the word count with vowel sounds", "sentence": "Forced to write an actual bridge with real words and metaphors."}], "hidden_meanings": "Clearly, this song is an elaborate allegory about Rick Astley's commitment to his gym membership — he's never gonna give it up, never gonna let it down, never gonna run around (except on the treadmill). The repeated insistence that he won't 'desert' anyone is obviously a commentary on his stance on climate change and desert preservation.", "final_verdict": "This song is what happens when someone mistakes relationship hostage negotiation for romance. It's the lyrical equivalent of announcing you're a nice guy — if you have to say it this many times, we're all starting to have questions.", "artist": "Rick Astley", "title": "Never Gonna Give You Up", "severity": "medium"}