{"overall_score": 3, "overall_score_comment": "This song has the lyrical depth of a motivational poster in a dentist's waiting room, written by someone who just discovered the copy-paste function.", "the_roast": "Let's start with the elephant convulsing in the room: this song says 'shake' SEVENTY-EIGHT TIMES. That's not a chorus, that's a neurological condition. I've seen Parkinson's patients with more restraint. The lyrical equivalent of watching someone hit the same piano key for three minutes while insisting it's a symphony. Beethoven is rolling over so hard in his grave he's generating renewable energy.\n\nThe opening confession 'Got nothing in my brain / That's what people say' isn't a criticism to defend against—it's apparently the mission statement. This is followed by the revolutionary insight that 'players gonna play' and 'haters gonna hate,' which is about as profound as saying 'breathers gonna breathe' or 'existers gonna exist.' Congratulations, you've discovered tautology and decided to repeat it five times per line in case we were too stupid to grasp the concept of people doing things they do. It's like a philosophical thesis written by a Magic 8-Ball with a concussion.\n\nThe bridge offers us 'this sick beat,' which is particularly bold considering the lyrics have the complexity of a See-Spot-Run book. 'My ex-man bought his new girlfriend' is grammatically having an identity crisis—did he buy her at Costco? And the 'fella over there with the hella good hair' line sounds like it was workshopped at a middle school dance by someone who just learned the word 'hella' exists. The entire song reads like what an AI would generate if you fed it nothing but fortune cookies and Instagram captions from 2014.\n\nBut the real crime is the audacious 'I'll never miss a beat, I'm lightning on my feet'—immediately followed by admitting to just making moves up as you go. That's not lightning, that's a drunk giraffe on roller skates. The whole track is basically just three different ways to say 'I don't care what you think' repeated until your brain develops Stockholm syndrome and starts believing repetition equals substance. Spoiler alert: it doesn't.", "cliche_counter": [{"cliche": "Haters gonna hate / Players gonna play", "quip": "Congratulations on discovering that people do things! Next album: 'Walkers Gonna Walk' and 'Talkers Gonna Talk.'"}, {"cliche": "Shake it off", "quip": "Shaken 78 times. Not stirred. Just traumatized."}, {"cliche": "Can't stop, won't stop", "quip": "The grammatical equivalent of a toddler refusing to leave the playground. Should have stopped, definitely should have stopped."}, {"cliche": "Dancing on my own", "quip": "We know. That's what happens when the lyrics scare everyone away from the dance floor."}, {"cliche": "It's gonna be alright", "quip": "The music in your mind is lying to you. It's not alright. It's catastrophically wrong."}, {"cliche": "Ex brought a new girlfriend", "quip": "The only relationship drama less interesting than this is watching paint divorce drywall."}], "lyrical_crime_highlights": [{"line": "Got nothing in my brain / That's what people say", "crime": "Involuntary confession that should have triggered the right to remain silent", "sentence": "Must write 'I will not confess to crimes in my own lyrics' 500 times, once for each time this song says 'shake'"}, {"line": "Cause the players gonna play, play, play, play, play / And the haters gonna hate, hate, hate, hate, hate", "crime": "Assault with a deadly tautology; aggravated repetition in the first degree", "sentence": "Banned from using any verb twice in a row for the next five albums"}, {"line": "I shake it off, I shake it off (x47)", "crime": "Lyrical copy-paste fraud; criminal negligence of the thesaurus", "sentence": "Community service teaching a creative writing class where this song is Exhibit A of what not to do"}, {"line": "My ex-man bought his new girlfriend", "crime": "Grammar trafficking; illegal importation of syntax from a dimension where words don't mean things", "sentence": "Must diagram this sentence until it makes sense (life sentence)"}, {"line": "And to the fella over there with the hella good hair", "crime": "Using 'hella' in a pop song like it's still 2004; hair-based flirtation in a no-substance zone", "sentence": "Forced to listen to every song that rhymed better than 'hair' with 'there' until reformed"}], "hidden_meanings": "Clearly this is a post-modern deconstruction of capitalism where 'shaking it off' represents the worker's futile attempt to shake off their chains while the bourgeois 'players' and 'haters' continue their dialectical struggle. Or maybe it's just what happens when you realize you can rhyme a word with itself infinitely and still sell 10 million copies. The jury's still out, but the jury is also shaking it off because this testimony gave them tremors.", "final_verdict": "This song is what would happen if a fortune cookie had a nervous breakdown and decided to communicate exclusively through interpretive dance instructions. It's proof that sometimes the haters aren't hating—they're just trying to save your lyrical reputation from drowning in a sea of 'shake shake shake shake shake.'", "artist": "Taylor Swift", "title": "Shake It Off", "severity": "savage"}