{"overall_score": 6, "overall_score_comment": "It's like a fortune cookie wrote a self-help book while waiting for a bus that never came.", "the_roast": "Let's start with the elephant on the midnight train: 'South Detroit' doesn't exist, Journey. I mean, geographically, south of Detroit is literally CANADA. So congratulations, city boy was born and raised in Windsor, Ontario, which explains why he's so desperate to go 'anywhere.' These two vague protagonists meet on a train going 'anywhere' — which is either the most romantic lack of planning in history or just proof that neither of them can afford GPS. They're basically Tinder profiles come to life: 'Small town girl seeks city boy, must enjoy aimless transportation and geographical impossibilities.'\n\nThen we get to this 'smokey room' with 'cheap perfume' where people share smiles for the night, and I'm like, is this a karaoke bar or a really depressing episode of Dateline? 'For a smile they can share the night' is doing some HEAVY lifting here, folks. That's the lyrical equivalent of 'yeah, stuff happened' — real specific, Steve Perry. And apparently this wholesome exchange 'goes on and on and on and on' because repetition is what you do when you can't think of another rhyme. It's not profound; it's a loading screen.\n\nMy favorite crime is 'Streetlights, people' — two words, no verb, just vibes. It's like someone shouted random nouns during band practice and everyone was too polite to ask what it meant. Are the streetlights FOR the people? Made OF people? Is this a Soylent Green situation? We'll never know because Journey was too busy believing to bother with sentence structure. And these people are 'livin' just to find emotion' — as opposed to what, living to collect stamps? That's not deep, that's just what EVERYONE does. That's like saying 'humans, breathing just to not die.'\n\nThe whole song is basically one long motivational poster that got lost at a bus station. 'Don't stop believin'' — believing in WHAT? Your Greyhound ticket? The structural integrity of South Detroit? The song never tells us, it just yells the title at us like a life coach having a breakdown. 'Hold on to the feelin'' — again, WHICH feeling? Confusion? Hunger? The desire to consult a map? This is the lyrical equivalent of a participation trophy: congratulations, you showed up and had some vague emotions about it.", "cliche_counter": [{"cliche": "Small town girl/city boy trope", "quip": "Romeo and Juliet if they met at a Greyhound station and neither had a personality"}, {"cliche": "Midnight train going anywhere", "quip": "The transportation metaphor for people who peaked at freshman philosophy class"}, {"cliche": "Strangers in the night", "quip": "Frank Sinatra did it first and with actual sentences"}, {"cliche": "Some will win, some will lose", "quip": "Thanks for explaining how competition works, Journey. Really cracked the code there"}, {"cliche": "The movie never ends", "quip": "Unlike this verse, which should have ended two 'on and on's ago"}], "lyrical_crime_highlights": [{"line": "Born and raised in South Detroit", "crime": "Geography fraud", "sentence": "Mandatory attendance at a remedial atlas reading class"}, {"line": "Streetlights, people", "crime": "Complete abandonment of grammar", "sentence": "Diagramming this sentence until you understand what a verb is"}, {"line": "It goes on and on and on and on", "crime": "Lyrical laziness disguised as emphasis", "sentence": "Writing 'on and on' one thousand more times to see how it feels"}, {"line": "Livin' just to find emotion", "quip": "Stating the obvious as if it's profound", "sentence": "Explaining human existence to an actual philosopher for 30 minutes"}, {"line": "For a smile they can share the night", "crime": "The vaguest euphemism ever committed to tape", "sentence": "Rewriting this with actual specificity, even if it's just about board games"}], "hidden_meanings": "Clearly this is an allegory about two NPCs who escaped their video game but forgot to load their character development files. The 'midnight train going anywhere' represents humanity's existential crisis, or maybe just Journey's refusal to commit to literally any detail. 'Streetlights, people' is obviously a commentary on how we're all just illuminated meat sacks wandering the earth until we find out which Glee episode we're in.", "final_verdict": "This song is what happens when you turn a motivational poster into a Choose Your Own Adventure book but rip out all the choices. It's catchy enough to forgive, but these lyrics have the specificity of a horoscope and the depth of a puddle — a really singable, stadium-rocking puddle.", "artist": "Journey", "title": "Don't Stop Believin'", "severity": "medium"}