{"overall_score": 4, "overall_score_comment": "A participation trophy for showing up to therapy and then writing a song about it instead of actually going.", "the_roast": "Let's start with the elephant in the room: 'I get older but just never wiser' followed immediately by THREE WHOLE MINUTES proving that exact point. This is like watching someone describe their emotional immaturity in 4K Ultra HD while somehow thinking self-awareness equals a personality. 'When my depression works the graveyard shift' — congratulations, you've turned clinical depression into a retail job metaphor. I'm sure everyone at the DSM-5 conference is taking notes. And 'Midnights become my afternoons'? That's not depression, Karen, that's called being a millionaire with no alarm clock.\n\nThe chorus is basically a hostage negotiation with yourself where you're both the hostage AND the bad guy. 'It's me, hi, I'm the problem, it's me' repeated so many times it becomes a mantra for people who peaked at calling themselves 'problematic faves' on Twitter. 'I'll stare directly at the sun but never in the mirror' is trying SO HARD to be profound that it pulled a muscle. We get it, you have commitment issues with your own reflection. But the REAL crime is 'at tea time, everybody agrees' — what is this, a British period drama? Are we roasting you over crumpets? Did Lady Whistledown write this line?\n\n'Sometimes I feel like everybody is a sexy baby / And I'm a monster on the hill' — EXCUSE ME? A sexy baby? THOSE ARE TWO WORDS THAT SHOULD NEVER DATE, let alone get married in a song lyric. This reads like someone watched 30 Rock once, misunderstood the joke, and decided to make it their entire personality. 'Too big to hang out, slowly lurching towards your favorite city' makes you sound like Godzilla with anxiety and a Seamless account. 'Pierced through the heart but never killed' — oh, so you're a zombie now? Pick a metaphor and commit! Are you a monster, a giant, or an unkillable emotional vampire? The only thing 'pierced through' here is my patience.\n\nBut NOTHING, and I mean NOTHING, prepared me for 'Did you hear my covert narcissism lightly disguised as altruism / Like some kind of congressman.' First of all, calling your own narcissism 'covert' is like announcing you're going to surprise someone — it defeats the purpose! If it's covert, maybe don't ANNOUNCE IT IN THE CHORUS OF A POP SONG? And comparing yourself to a congressman? That's not the self-own you think it is. That's like saying 'I'm terrible with money, like an offshore tax haven!' The bar for self-awareness is literally in hell, and somehow you've dug underneath it.\n\nThe bridge about the daughter-in-law killing you for inheritance money is what happens when someone watches too much Succession and thinks family dysfunction is quirky. 'She's laughing up at us from hell' — UP from hell? GEOGRAPHY! Hell is DOWN! If you're going to write about your own afterlife, at least Google which direction eternal damnation is! This whole verse reads like a will.i.am fever dream crossed with a Dateline NBC episode that got cancelled for being too unhinged. It has NOTHING to do with the rest of the song except proving that yes, we really should be exhausted from rooting for you.", "cliche_counter": [{"cliche": "Depression as a character/entity", "quip": "Depression working the graveyard shift like it's filing TPS reports at Dunder Mifflin"}, {"cliche": "Self-sabotage as personality", "quip": "Being your own worst enemy stopped being interesting around the same time LiveJournal died"}, {"cliche": "The mirror avoidance metaphor", "quip": "Not looking in mirrors isn't deep, it's how vampires justify bad eyeliner"}, {"cliche": "Waking up screaming", "quip": "The only thing getting screamed at here is this rhyme scheme begging for mercy"}, {"cliche": "Everyone's the problem but also I'm the problem", "quip": "Schrodinger's accountability — simultaneously taking responsibility and avoiding it"}, {"cliche": "Self-deprecating = depth", "quip": "Insulting yourself isn't therapy, it's just Instagram caption energy in B minor"}], "lyrical_crime_highlights": [{"line": "Sometimes I feel like everybody is a sexy baby", "crime": "Crimes against humanity and the English language simultaneously", "sentence": "Mandatory viewing of what those words actually mean until you apologize to babies everywhere"}, {"line": "At tea time, everybody agrees", "crime": "Cultural appropriation of British afternoon rituals for no narrative reason", "sentence": "Forced to explain this lyric to an actual British person while they slowly sip Earl Grey in judgment"}, {"line": "Did you hear my covert narcissism lightly disguised as altruism", "crime": "Trying to sound smart by using a thesaurus while missing the irony entirely", "sentence": "Ten years of actually covert behavior without announcing it in pop songs"}, {"line": "She's laughing up at us from hell", "crime": "Fundamental misunderstanding of directional theology", "sentence": "Remedial geography and a subscription to Dante's Inferno for Dummies"}, {"line": "I should not be left to my own devices / They come with prices and vices / I end up in crisis", "crime": "Rhyming words that sound identical because you gave up", "sentence": "Forced collaboration with an actual poet until you learn that rhyming isn't just adding '-ices' to everything"}], "hidden_meanings": "Clearly this is an elaborate metaphor for capitalism's impact on the millennial psyche, where 'sexy baby' represents late-stage consumerism and the 'monster on the hill' is obviously student loan debt personified. The daughter-in-law murder plot? That's just generational wealth anxiety filtered through a Clue board game aesthetic. Or, hear me out, maybe it's just what happens when you write lyrics at 3 AM after reading one Wikipedia article about Freud.", "final_verdict": "This song is what you'd get if a therapy session, a Reddit confessional, and a Hot Topic journal had a baby and that baby learned guitar. The only 'anti-hero' here is the rhyme scheme that bravely sacrificed itself so we could all suffer together.", "artist": "Taylor Swift", "title": "Anti-Hero", "severity": "savage"}