{"overall_score": 6, "overall_score_comment": "It's like a goth girl discovered the concept of commitment and immediately threatened to haunt someone forever.", "the_roast": "Okay Billie, we need to talk about your definition of romance because 'I want you to stay til I rot away, dead and buried' is not the vibe most people are going for on a first date. This sounds less like a love song and more like the terms and conditions for a very specific haunting contract. You're literally asking someone to carry your casket while simultaneously threatening 'if you go, I'm going too' — which is sweet in a restraining-order kind of way.\n\nThe whole 'if I'm turning blue, please don't save me' line is peak dramatic. We get it, you'd rather die than be alone, but maybe let's dial back the melodrama to like, a seven instead of a full ten? You're out here writing wedding vows that double as a suicide pact. 'Nothing left to lose without my baby' — girl, you could lose your Spotify royalties if you keep threatening to throw yourself in the grave every verse.\n\nAnd can we discuss the emotional whiplash of 'you're so full of shit' followed immediately by 'don't be stupid'? One minute you're planning your eternal burial arrangements together, the next you're calling them out like a disappointed mom. Pick a lane! Are we doing ride-or-die romance or couples therapy? The 'I knew you in another life' ending is the cherry on top of this reincarnation sundae — because apparently one lifetime of codependency wasn't enough, you had to make it multi-dimensional.", "cliche_counter": [{"cliche": "Loving someone 'til the day that I die", "quip": "Said approximately 47 times, just in case we didn't get the mortality theme"}, {"cliche": "Birds of a feather stick together", "quip": "Yes, they also migrate seasonally and poop on cars, but go off"}, {"cliche": "Better off alone (but not really)", "quip": "The 'I'm fine being single' to 'please never leave me' pipeline in record time"}, {"cliche": "Knew you in another life/past lives", "quip": "The astrology girl's favorite explanation for codependency"}, {"cliche": "Weather as a metaphor for feelings", "quip": "Can't change the weather, but could maybe change the song title to 'Emotional Hostage Situation'"}], "lyrical_crime_highlights": [{"line": "'Til I rot away, dead and buried / 'Til I'm in the casket you carry", "crime": "Aggressive funeral planning in a love song", "sentence": "Mandatory attendance at a romantic comedy to learn what normal couples talk about"}, {"line": "And if I'm turnin' blue, please don't save me", "crime": "Weaponizing your own hypothetical death", "sentence": "One therapy session for every time you mentioned dying (so like, eight sessions)"}, {"line": "But you're so full of shit, uh / Tell me it's a bit, oh", "crime": "Calling your soulmate a liar mid-devotion anthem", "sentence": "Writing 500 words on healthy communication strategies"}, {"line": "If you go, I'm goin' too", "crime": "Codependency masquerading as devotion", "sentence": "Reading literally any book about maintaining separate identities in relationships"}, {"line": "I knew you in another life / You had that same look in your eyes", "crime": "Using past life regression to justify current attachment issues", "sentence": "Explaining the difference between reincarnation and just really liking someone"}], "hidden_meanings": "This is clearly a meditation on the existential dread of losing connection in an increasingly isolated world, or maybe it's just about being really, really clingy and making it sound poetic. The birds metaphor is actually quite deep: birds mate for life, travel together, and also sometimes aggressively attack their own reflections in windows, which feels appropriate here.", "final_verdict": "It's a beautiful song that makes eternal devotion sound like a true crime podcast waiting to happen. Someone check on Billie's romantic interest and make sure they know where the exits are.", "artist": "Billie Eilish", "title": "Birds of a Feather", "severity": "medium"}